Issued Revision Clouds can't be modified.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ProhibitModificationOfIssuedRevisionCloud { get; }
  Visual Basic
Public Shared ReadOnly Property ProhibitModificationOfIssuedRevisionCloud As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ProhibitModificationOfIssuedRevisionCloud {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RevisionCloudFailures Class
  Autodesk.Revit.DB Namespace